Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/compressible/rhoSimpleFoam/squareBendLiq/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;

    limited             cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwind limited;
    div(phi,e)          bounded Gauss linearUpwind limited;
    div(phi,epsilon)    bounded Gauss linearUpwind limited;
    div(phi,k)          bounded Gauss linearUpwind limited;
    div(phi,Ekp)        bounded Gauss linearUpwind limited;

    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
